# Python Reference-Guide - Pandas

### import Pandas

In [1]:
import pandas as pd

### Creating a pandas DataFrame

In [2]:
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [3]:
df = pd.DataFrame(data)
df

      Name  Age
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10

### Create Pandas DataFrame from a Numpy array

In [10]:
import numpy as np
numpy_data = np.array([[5, 2], [8, 1]])

In [11]:
df = pd.DataFrame(data=numpy_data, index=["row1", "row2"], columns=["column1", "column2"])
df

      column1  column2
row1        5        2
row2        8        1

### Selecting a Column

In [12]:
# Dictionary of key pair values called data
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [13]:
df = pd.DataFrame(data)
df[['Name']]

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

### Selecting a Row

In [14]:
# Dictionary of key pair values called data
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [15]:
df = pd.DataFrame(data)
row = df.loc[1]
row

Name    Tanu
Age       23
Name: 1, dtype: object

### Select Data

In [16]:
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [18]:
df = pd.DataFrame(data)
df['Age']

0    24
1    23
2    22
3    19
4    10
Name: Age, dtype: int64

### Delete Data

In [19]:
data = {'Name':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'Age': [24, 23, 22, 19, 10]}
data

{'Name': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'Age': [24, 23, 22, 19, 10]}

In [20]:
del df['Age']
df

      Name
0   Ashika
1     Tanu
2   Ashwin
3    Mohit
4  Sourabh

### Renaming the Columns or Indices of a DataFrame

In [22]:
### # Dictionary of key pair values called data
data = {'NAMe':['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
        'AGe': [24, 23, 22, 19, 10]}
data

{'NAMe': ['Ashika', 'Tanu', 'Ashwin', 'Mohit', 'Sourabh'],
 'AGe': [24, 23, 22, 19, 10]}

In [23]:
df = pd.DataFrame(data)
df

      NAMe  AGe
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10

In [24]:
newcols = {
            'NAMe': 'Name',
            'AGe': 'Age'
          }
df.rename(columns=newcols, inplace=True)
df

      Name  Age
0   Ashika   24
1     Tanu   23
2   Ashwin   22
3    Mohit   19
4  Sourabh   10